[
{"id": "legend_of_phoenix", "title": "Legend of Phoenix", "image": "https://avt.mkklcdnv3.com/avatar_225/3580-legend_of_phoenix.jpg", "story_alternative": ["Alternative : Chi Huang Chuan Qi ; 赤凰传奇"], "author": ["Yun Tian Kong"], "status": "Ongoing", "last_updated": "Feb-22-2019 00:43:20 AM", "view": "821,411", "genres": ["Action", "Adventure", "Fantasy", "Martial arts"], "score": "4.66", "votes": "106", "summary": "Orignial Comic: http://ac.qq.com/Comic/comicInfo/id/537667"},
{"id": "yowamushi_pedal", "title": "Yowamushi Pedal", "image": "https://avt.mkklcdnv3.com/avatar_225/2237-yowamushi_pedal.jpg", "story_alternative": ["Alternative : 弱虫ペダル (Japanese); 飆速宅男 (Chinese); Weakling Pedal (English)"], "author": ["Watanabe Wataru (渡辺航)"], "status": "Ongoing", "last_updated": "Feb-22-2019 02:44:38 AM", "view": "3,723,025", "genres": ["Comedy", "Drama", "Shounen", "Sports"], "score": "4.69", "votes": "87", "summary": "Otaku Sakamichi Onoda has just entered high school and plans to join the anime club. In middle school, Onoda didn’t have any friends with whom he could talk about anime, games, Akihabara and other otaku things, and he is hoping he can make such friends in the anime club, but he finds out it's been disbanded. In order to reestablish the club he tries to find 4 other people who would like to join. Since he was a little boy, Onoda has ridden his mamachari–a bulky bicycle with a step-through frame mainly used for short rides, such as for casual fun or to pick up groceries–to go to Akihabara every week to check out or buy otaku things. Fellow freshman Shunsuke Imaizumi and bicyclist, while training, notices a boy (Onoda) riding his mamachari up a steep road. Freshman and road racing cyclist, Shokichi Naruko visits Akihabara to get some Gundam plastic models for his younger brothers and meets Onoda who catches his attention because of the his cycling skill on the mamachari and later find out they go to the same school. Later on, both Naruko and Imaizumi try to convince him to join the bicycle racing club, but will he?"},
{"id": "otome_danshi_ni_koisuru_otome", "title": "Otome Danshi ni Koisuru Otome", "image": "https://avt.mkklcdnv3.com/avatar_225/19220-otome_danshi_ni_koisuru_otome.jpg", "story_alternative": ["Alternative : A maiden in love with a man-in-drag ; 乙女男子に恋する乙女"], "author": ["Shimazaki Mujirushi"], "status": "Ongoing", "last_updated": "Feb-22-2019 02:15:34 AM", "view": "2,841,783", "genres": ["Comedy", "Romance", "School life", "Shoujo"], "score": "4.68", "votes": "105", "summary": "A 30 episodes short comic by Shimazaki MujirushiMizuguchi Mayu, a girl who hates men, fell in love at first sight with a... \"man-in-drag\"!?Does she likes \"girls\"? Or does she likes \"boys\"?Find out in this heart throbbing pure love comedy! (from twi4)"},
{"id": "haken_no_kouki_altina", "title": "Haken no Kouki Altina", "image": "https://avt.mkklcdnv3.com/avatar_225/17246-haken_no_kouki_altina.jpg", "story_alternative": ["Alternative : Принцесса меча Алтина ; 覇剣の皇姫アルティーナ ; 霸剑的皇姬阿尔缇娜 ; 霸剑皇姬阿尔缇娜 ; Altina the Sword Princess"], "author": ["Murasaki Yukiya"], "status": "Ongoing", "last_updated": "Feb-22-2019 03:18:22 AM", "view": "781,783", "genres": ["Action", "Adult", "Adventure", "Cooking", "Drama", "Fantasy", "Harem", "Romance", "Shounen"], "score": "4.65", "votes": "139", "summary": "Regis Ulrich is an incapable soldier; bad at both sword and archery, who passes the time by only reading books. While transferring to a remote region post, he meets a girl who turns out be the red hair and crimson eyed princess Altina, the wielder of the great sword \"Grantneil Catoll.\" Despite being only fourteen years old, she was appointed to become the commander of the army in this remote region simply because she was the illegitimate child of the Emperor. However, she continues to pursue her dream of becoming Empress despite the circumstances that surround her. To achieve this goal, she asks Regis to become her tactician and stand alongside her against the obstacles they are sure to face."},
{"id": "bw918450", "title": "Meng Shi Zai Shang", "image": "https://avt.mkklcdnv3.com/avatar_225/22094-bw918450.jpg", "story_alternative": ["Alternative : The Distinguished Cute Master;萌师在上"], "author": ["Big Demon King Man Hua"], "status": "Ongoing", "last_updated": "Feb-22-2019 01:44:54 AM", "view": "75,461", "genres": ["Action", "Comedy", "Fantasy", "Martial arts", "Romance"], "score": "4.57", "votes": "37", "summary": "She transmigrated as the opposing boss in the novel, but she was wiped out by the male lead. Fortunately, she reincarnates once more, but back to the past, when the male lead was still young! Looking at the pitifully weak male lead, she was troubled by a dilemma. Should she: 1. kill him, or 2. raise him up and openly ask for treasures from him. However, since she wants to get all sorts of treasures from the male lead, she chose the second option. Things don't always work out though, as she accidentally raises a sheep up to be a big bad wolf."},
{"id": "vj917571", "title": "Beauty and the Beast Girl", "image": "https://avt.mkklcdnv3.com/avatar_225/21191-vj917571.jpg", "story_alternative": ["Alternative : Bocchi Kaibutsu to Moumoku Shoujo ; Lonely monster and blind girl ; ぼっち怪物と盲目少女"], "author": ["Neji"], "status": "Ongoing", "last_updated": "Feb-22-2019 06:44:36 AM", "view": "742,085", "genres": ["Comedy", "Ecchi", "Fantasy", "Romance", "Yuri"], "score": "4.49", "votes": "188", "summary": "When a monster girl stumbles upon a blind girl who doesn't run away from her, the two begin to bond. The blind girl listens to the monster as if she were human, and the monster slowly begins to feel warmth in her heart."},
{"id": "the_portal_of_wonderland", "title": "The Portal of Wonderland", "image": "https://avt.mkklcdnv3.com/avatar_225/20043-the_portal_of_wonderland.jpg", "story_alternative": ["Alternative : 玄界之 ; 玄界之门 ; Xuan Jie Zhi Men"], "author": ["Wang Yu"], "status": "Ongoing", "last_updated": "Feb-22-2019 01:48:14 AM", "view": "1,436,331", "genres": ["Action", "Adventure", "Fantasy", "Martial arts", "Romance", "Tragedy"], "score": "4.71", "votes": "160", "summary": "A wonder falling down from heaven! A boy possessed by strange blood! Gods tremble! Demons flee! A boy from the land of Dong Zhou. A pink skull as his sworn friend until death. A story of a determined warrior struggling for power. A legend that shakes the galaxy and disturbs the worlds of god, demon and man."},
{"id": "vw918000", "title": "Peach Girl Next", "image": "https://avt.mkklcdnv3.com/avatar_225/21614-vw918000.jpg", "story_alternative": ["Alternative : ピーチガールNEXT"], "author": ["Miwa Ueda"], "status": "Ongoing", "last_updated": "Feb-22-2019 02:46:06 AM", "view": "48,364", "genres": ["Comedy", "Drama", "Josei", "Romance", "Shoujo", "Slice of life"], "score": "4.55", "votes": "11", "summary": "It's been 10 years since Momo and Kairi got together. The two are counting the days until their wedding, but Sae suddenly appears, and Toji along with her. The love of the four 27-year olds begins again! Don't miss the love hurricane!"},
{"id": "runway_de_waratte", "title": "Runway de Waratte", "image": "https://avt.mkklcdnv3.com/avatar_225/19266-runway_de_waratte.jpg", "story_alternative": ["Alternative : ランウェイで笑って ; 请在t台上微笑 ; Smile at the Runway"], "author": ["Inoya Kotoba"], "status": "Ongoing", "last_updated": "Feb-22-2019 02:48:24 AM", "view": "516,217", "genres": ["School life", "Shounen", "Slice of life"], "score": "4.83", "votes": "95", "summary": "Smile at the Runway starts with the story of Fujito Chiyuki, an aspiring fashion model and daughter of a fledgling Modeling Agency, Mille neige. Ever since she was little, Chiyuki's dream was to be the star model of her dad's agency and perform at Paris Fashion Week. With great looks and a gifted environment, it seemed like she was on the right track to fulfill her dream, but she soon found herself faced with a seemingly insurmountable wall when her height stopped growing at 158cm (5'2\"), hopelessly too short to be a professional model.Although Chiyuki still kept on believing in herself for years despite everyone telling her it's impossible, Chiyuki's resolve starts to crumble as she enters her last year of high school. This is when she meets Tsumura Ikuto, a lame classmate with a surprising talent for designing clothes, who is also considering giving up his dream due to unfortunate circumstances. Together, they begin the journey of doing the impossible in order to realize their dreams."},
{"id": "fy918074", "title": "My Short Senpai Is Way Too Cute", "image": "https://avt.mkklcdnv3.com/avatar_225/21689-fy918074.jpg", "story_alternative": ["Alternative : ちっちゃい先輩が可愛いすぎる, My Small Senpai Is Way Too Cute, Chitchai Senpai ga Kawaisugiru, Chitchai Sempai ga Kawaisugiru, Chitchai senpai ga kawaiisugiru"], "author": ["Ruiki Akiba"], "status": "Ongoing", "last_updated": "Feb-22-2019 01:14:29 AM", "view": "295,911", "genres": ["Comedy", "Slice of life"], "score": "4.82", "votes": "61", "summary": "An ordinary run-of-the-mill guy named Takase starts working in the Sales Department of a certain Real Estate agency, and his senpai at this job, Komai, looks more like a middle school girl than an actual adult due to her height and incredible cuteness! As they grow closer together, how will they deal with this unusual situation?"},
{"id": "reigen", "title": "Reigen", "image": "https://avt.mkklcdnv3.com/avatar_225/20905-reigen.jpg", "story_alternative": [], "author": ["One"], "status": "Ongoing", "last_updated": "Feb-22-2019 01:45:13 AM", "view": "60,757", "genres": ["Action", "Comedy", "Shounen", "Slice of life", "Supernatural"], "score": "4.47", "votes": "15", "summary": "Meet the self-proclaimed exorcist, spiritualist, and psychic himself. What he lacks in strength, he makes up for in charisma. What he lacks in bravery, he makes up for in ingenuity. What he lacks in heroism, he makes up for with massages and life advice. This is the story of Arataka Reigen and the Spirits and Such Consultation Office."},
{"id": "of917557", "title": "Teach the Devil Husband", "image": "https://avt.mkklcdnv3.com/avatar_225/21177-of917557.jpg", "story_alternative": ["Alternative : An ordinary girl stumbles on an injured black dog one day on her way home and decides to take him with her. But, when she falls asleep, the dog turns into a handsome man! What will happen next?!"], "author": ["Dazui", " Banban", " Cui Guan Nao"], "status": "Ongoing", "last_updated": "Feb-22-2019 02:46:54 AM", "view": "747,289", "genres": ["Josei", "Romance", "Smut", "Supernatural"], "score": "3.99", "votes": "98", "summary": "An ordinary girl stumbles on an injured black dog one day on her way home and decides to take him with her. But, when she falls asleep, the dog turns into a handsome man! What will happen next?!"},
{"id": "eu918510", "title": "Ragnarok M Stories: Laziest Creator", "image": "https://avt.mkklcdnv3.com/avatar_225/22154-eu918510.jpg", "story_alternative": ["Alternative : The Laziest Creator Ragnarok M: Eternal Love Story"], "author": ["Jaypee Millado"], "status": "Ongoing", "last_updated": "Feb-22-2019 01:48:23 AM", "view": "15,555", "genres": ["Adventure", "Comedy"], "score": "1.5", "votes": "8", "summary": "This is a series of screen shots taken from the game Ragnarok M: Eternal Love. It covers the Story of a Lazy Creator (Creator is a Job in Merchant Branch job). Merchant -> Alchemist -> Creator and then soon to be a Genetic."},
{"id": "am918447", "title": "Sweet Candy", "image": "https://avt.mkklcdnv3.com/avatar_225/22091-am918447.jpg", "story_alternative": ["Alternative : 甜涩糖果"], "author": ["Big Pot"], "status": "Ongoing", "last_updated": "Feb-22-2019 00:48:16 AM", "view": "26,750", "genres": ["Comedy", "Romance", "Shoujo", "Slice of life"], "score": "5", "votes": "10", "summary": "New nurse Li Xiao Guo chose Jiayu Hospital because it had a higher salary, her family had a lot of debt. Just a few days after she went to work, she suffered from unfortunate things such as her parents being scammed and going into more debt, her cell phone getting robbed, losing money for being late for work, and dereliction of duty. She wanted to sell her blood, but a special patient came to the hospital. Because of a special blood type, the two of them have formed a bond over blood..."},
{"id": "sugars_yamamori_mika", "title": "Sugars (YAMAMORI Mika)", "image": "https://avt.mkklcdnv3.com/avatar_225/2411-sugars_yamamori_mika.jpg", "story_alternative": ["Alternative : シュガーズ (YAMAMORI Mika) ; 蜜恋糖果 ; Sweet Sweets Stories"], "author": ["Yamamori Mika"], "status": "Ongoing", "last_updated": "Feb-22-2019 00:43:14 AM", "view": "174,922", "genres": ["Romance", "School life", "Shoujo"], "score": "5", "votes": "18", "summary": "A collection of six short stories per volume that revolve around a chain of people.1. No one ever asks Kie out. She’s 18, so her high school life is ending soon! Her friend tells her to eat a piece of candy that works like a love potion. All the guys are into her now, even her good friend Shimon! But when she really falls for him, she worries that their love is a lie…2. Mami (Kie’s BFF) always gets asked out, but consistently turns everyone down. One day she’s approached by a Jack Johnson-loving underclassman who wants her to test out some sweets. Mami doesn’t like sweets, but she ends up falling for him. Unfortunately, he’s already got someone he likes…3. Tomomi is called in on the day before Christmas Eve to fill in for a volunteer that couldn’t come to school to help bake cakes. The only other volunteer there turns out to be the student council president, who is totally quiet and nerdy. The two end up having fun together, though…4. Maika is in love with her teacher. She even goes out of her way to be with him– she volunteers after school to pick weeds. She thought it’d be just her and the teacher, but another boy ends up volunteering as well. Maika confesses to her teacher, and he ends up quitting his job. The other volunteer tells Maika that he did it so he could be together with her…5. Hiro completely transformed himself when he entered high school. He’s so popular he’s called “Mr. Valentine”! When Valentine’s day comes around, the only thing he can think of is the one girl who gave him chocolate back when he was ugly in middle school…6. Ginjirou has a good friend, Akira, who always steals his thunder. It’s especially humiliating because Akira is actually a girl (but she looks like a gorgeous guy). Whenever a girl’s into Gin and they happen to meet Akira, they always end up falling for the latter. But when a guy asks Akira out, Gin gets a little jealous…"},
{"id": "ic918513", "title": "Lady and Oldman", "image": "https://avt.mkklcdnv3.com/avatar_225/22157-ic918513.jpg", "story_alternative": ["Alternative : The man Who Lives more than 100 Years and the Lady; Lady and old man; Lady & old man; Lady & Oldman;Леди и Старик;レディ&オールドマン"], "author": ["Ono Natsume"], "status": "Ongoing", "last_updated": "Feb-22-2019 00:39:51 AM", "view": "2,253", "genres": ["Adventure", "Seinen", "Supernatural"], "score": "5", "votes": "2", "summary": "The story takes place in 1963 Los Angeles. A pair known as \"Lady and Oldman\" wander from street to street for delivery missions on their motorcycle and sidecar, sometimes getting caught in cases and sometimes finding solutions. Lady (Shelly) was a 19-year-old waitress at her father's diner and Oldman (Rob) is a fellow who served 100 years in prison yet mysteriously looks young and can heal quickly."},
{"id": "pr918511", "title": "His Feelings", "image": "https://avt.mkklcdnv3.com/avatar_225/22155-pr918511.jpg", "story_alternative": [], "author": ["Helsenn"], "status": "Ongoing", "last_updated": "Feb-22-2019 00:24:41 AM", "view": "6,648", "genres": ["Comedy", "Drama", "Romance", "School life", "Shounen ai", "Slice of life", "Yaoi"], "score": "5", "votes": "2", "summary": "“I don’t want to fall in love with anyone.” That’s what Wataru told himself, not expecting his encounter with Satago, a tall, blond and thug-looking guy, who speaks his mind a little too bluntly and seems particularly interested in his schoolmate’s lack of expressiveness."},
{"id": "yd917576", "title": "Cosmo Familia", "image": "https://avt.mkklcdnv3.com/avatar_225/21196-yd917576.jpg", "story_alternative": ["Alternative : Cosmo Familia*"], "author": ["Hanokage."], "status": "Ongoing", "last_updated": "Feb-22-2019 00:14:02 AM", "view": "101,321", "genres": ["Sci fi", "Seinen", "Supernatural"], "score": "4.7", "votes": "20", "summary": "The world is devastated by the sudden stampede of the mysterious invading creatures called 'cosmof'. Amakawa Alice still believes that her family, that disappeared 6 years ago, will return. Can she protect her home on her own?"},
{"id": "deatte_5_byou_de_battle", "title": "Deatte 5 Byou de Battle", "image": "https://avt.mkklcdnv3.com/avatar_225/19968-deatte_5_byou_de_battle.jpg", "story_alternative": [], "author": ["HARAWATA Saizou", " MIYAKO Kashiwa"], "status": "Ongoing", "last_updated": "Feb-22-2019 00:13:26 AM", "view": "1,384,979", "genres": ["Action", "Shounen", "Supernatural"], "score": "4.59", "votes": "111", "summary": "It was just a usual morning. Akira Shiroyanagi, a high schooler who loves games and Konpeito (Japanese sweets), has suddenly been dragged into a battlefield by a mysterious girl who calls herself Mion. The participants are told that they are \"erased from the family register, involved in an experiment, and gained certain powers.\""},
{"id": "jy918077", "title": "Ghost Child", "image": "https://avt.mkklcdnv3.com/avatar_225/21692-jy918077.jpg", "story_alternative": ["Alternative : 귀태 : 몽중연가"], "author": ["Penguin", " Unknown"], "status": "Ongoing", "last_updated": "Feb-22-2019 00:13:36 AM", "view": "104,194", "genres": ["Adult", "Horror", "Mature", "Romance", "Webtoons", "Yaoi"], "score": "4.5", "votes": "14", "summary": "Jo Sungjae spends passionate nights with the ghost that visits him every night- a ghost that resembles Dohwi, the person he loves, and as the nights progress, his condition worsens. Dowhi is worried about Sungae and invites him over to his house… What could Hong Dowhi’s birth secret be? Will the enchanted Jo Sungjae be able to survive till the end?"},
{"id": "star_martial_god_technique", "title": "Star Martial God Technique", "image": "https://avt.mkklcdnv3.com/avatar_225/17741-star_martial_god_technique.jpg", "story_alternative": ["Alternative : 星武神诀 (Chinese); Xing Wu Shen Jue (Novel); Xīng Wǔ Shén Jué; Tinh Võ Thần Quyết; Tinh Vũ Thần Quyết (Vietnamese - Tiếng Việt - TV)"], "author": ["Mad Snail"], "status": "Ongoing", "last_updated": "Feb-22-2019 00:12:00 AM", "view": "37,103,062", "genres": ["Action", "Adventure", "Drama", "Fantasy", "Harem", "Manhua", "Martial arts", "Romance", "Seinen"], "score": "4.67", "votes": "1993", "summary": "In the whole world there lays twelve paths to climb Tower of God, and in legends these twelve pathways leads toward legendary road of immortality. However these paths in the Tower of God, are far too long, without end. In ancient times there once were many types of martial arts, sadly the world underwent terrible changes, and only three were left: Flame, Dragon and Star Martial Arts. Generations of experts of those three martial arts are searching for the road of immortality. A Star Martial Arts practitioner on his journey of lifetime, plans to become the Highest God."},
{"id": "captain_tsubasa_rising_sun", "title": "Captain Tsubasa - Rising Sun", "image": "https://avt.mkklcdnv3.com/avatar_225/9432-captain_tsubasa_rising_sun.jpg", "story_alternative": ["Alternative : キャプテン翼 ライジングサン ; Captain Tsubasa: Rising Sun"], "author": ["Takahashi Yoichi"], "status": "Ongoing", "last_updated": "Feb-22-2019 00:11:38 AM", "view": "1,178,670", "genres": ["Seinen", "Sports"], "score": "4.86", "votes": "37", "summary": "Captain Tsubasa - Rising Sun summary is updating. Come visit Mangakakalot.com sometime to read the latest chapter of Captain Tsubasa - Rising Sun. If you have any question about this manga, Please don't hesitate to contact us or translate team. Hope you enjoy it."},
{"id": "finally_living_together_with_my_antifan", "title": "Finally Living Together with my Anti-Fan", "image": "https://avt.mkklcdnv3.com/avatar_225/20054-finally_living_together_with_my_antifan.jpg", "story_alternative": ["Alternative : 终于和黑粉同居了"], "author": ["Hua Xiang Gong Zuo Shi"], "status": "Ongoing", "last_updated": "Feb-22-2019 00:11:02 AM", "view": "1,050,401", "genres": ["Comedy", "Shounen ai", "Webtoons", "Yaoi"], "score": "4.42", "votes": "154", "summary": "Popular idol Juna is forced to leave the group due to a homosexual scandal. Half a year later, he enters campus as \"Han JunRan\", a university student. However, by a twist of fate, his roommate turns out to be his number one anti-fan!? Living together with his anti-fan will turn out to be a complicated experience..."},
{"id": "kingdom", "title": "Kingdom", "image": "https://avt.mkklcdnv3.com/avatar_225/142-kingdom.jpg", "story_alternative": ["Alternative : キングダム (Japanese); 王者天下 (Chinese); Kingdom (English); Vương Giả Thiên Hạ (Vietnamese - Tiếng Việt - TV); Kerajaan (Indonesian - Malay); Reino (Portuguese); Королевство (Russian)"], "author": ["Hara Yasuhisa"], "status": "Ongoing", "last_updated": "Feb-21-2019 22:43:38 PM", "view": "25,525,858", "genres": ["Action", "Adult", "Adventure", "Comedy", "Drama", "Historical", "Martial arts", "Romance"], "score": "4.83", "votes": "1012", "summary": "Millions of years have passed since the times of legends, when the worlds of man and gods were still the same. In these times it was the desires of man that moved the world. It is the era of the 500 year war - The "},
{"id": "ta917663", "title": "Mado kara Madoka-chan", "image": "https://avt.mkklcdnv3.com/avatar_225/21282-ta917663.jpg", "story_alternative": ["Alternative : Madoka from the Window"], "author": ["Yasuhiro Fukuda"], "status": "Ongoing", "last_updated": "Feb-22-2019 00:10:05 AM", "view": "241,148", "genres": ["Comedy", "Seinen", "Slice of life"], "score": "4.91", "votes": "45", "summary": "The mostly quiet Madoka-chan likes to hang out at her window, where some salary man tends to pass by, leading to Madoka doing all kinds of activities."},
{"id": "uat947546", "title": "Ueno-san wa Bukiyou", "image": "https://avt.mkklcdnv3.com/avatar_225/853-uenosan_wa_bukiyou.jpg", "story_alternative": ["Alternative : 上野さんは不器用"], "author": ["Tugeneko"], "status": "Ongoing", "last_updated": "Feb-21-2019 17:40:37 PM", "view": "328,435", "genres": ["Seinen"], "score": "4.72", "votes": "39", "summary": "Ueno-san wa Bukiyou summary is updating. Come visit MangaNelo.com sometime to read the latest chapter of Ueno-san wa Bukiyou. If you have any question about this manga, Please don't hesitate to contact us or translate team. Hope you enjoy it."},
{"id": "ms918512", "title": "Demons and Strangers", "image": "https://avt.mkklcdnv3.com/avatar_225/22156-ms918512.jpg", "story_alternative": ["Alternative : 邪魔外道"], "author": ["Wuhan"], "status": "Ongoing", "last_updated": "Feb-22-2019 00:08:26 AM", "view": "15,691", "genres": ["Action", "Martial arts"], "score": "4.86", "votes": "7", "summary": "Mo Lianjian, a young disciple who lost his parents when he was little, expertise on the practice is a struggle especially when his genius childhood friend, Lian Beibei always tries to pick a fight. One day, Mo obtains a fragment of a legendary sword which is rumored to be owned by the last swordsman of Yuhun Sect..."},
{"id": "you_are_my_lovely_dragon_king", "title": "You Are My Lovely Dragon King", "image": "https://avt.mkklcdnv3.com/avatar_225/20857-you_are_my_lovely_dragon_king.jpg", "story_alternative": ["Alternative : Ai Shang Ao Jiao Long Wangye ; 爱上傲娇龙王爷"], "author": ["San xian yi mian"], "status": "Ongoing", "last_updated": "Feb-21-2019 22:43:52 PM", "view": "364,123", "genres": ["Fantasy", "Romance"], "score": "4.66", "votes": "107", "summary": "A proud and dainty white dragon hiding in the human world unexpectedly runs into a sharp girl studying medicine! Not only instructs him to do CPR but also accidentally injures him with a needle? This start arrives at the highest degree, that girl who has a poisonous tongue, was she sent by the mankind to test me?"},
{"id": "memesis", "title": "Memesis (Yagyuu Takuya)", "image": "https://avt.mkklcdnv3.com/avatar_225/20002-memesis.jpg", "story_alternative": ["Alternative : メメシス ; Memesis"], "author": ["YAGYUU Takuya"], "status": "Ongoing", "last_updated": "Feb-21-2019 22:43:22 PM", "view": "927,471", "genres": ["Action", "Adventure", "Comedy", "Drama", "Fantasy", "Shounen"], "score": "4.59", "votes": "76", "summary": "In a fantasy world where monsters roam the land, the heroes party of Leon, Kijira and Ash traveled and slayed monsters together. But when Leon broke up with his partners so he could hang out with cute girls, Kijira and Ash starts carving their own legacy and it's one built on the back of jealousy as they look to overcome Leon in both monster slaying and women wooing."},
{"id": "vn918397", "title": "Karate Shoukoushi Monogatari", "image": "https://avt.mkklcdnv3.com/avatar_225/22042-vn918397.jpg", "story_alternative": ["Alternative : The Tale of Little Lords of Karate;Karate Shôkôshi Monogatari; KSM; 空手小公子物語"], "author": ["Baba Yasushi"], "status": "Ongoing", "last_updated": "Feb-21-2019 22:22:03 PM", "view": "64,598", "genres": ["Action", "Comedy", "Martial arts", "Seinen", "Sports"], "score": "4.5", "votes": "4", "summary": " Takeru and Meo, two best friends both troubled by tragedies in their pasts, have been sweeping local junior karate tournaments as high school freshmen. But now, they set their sights on a national karate tournament. Unfortunately, the funding required to achieve their goal can only be secured if they form an official karate club at their school. Their first challenge lies in getting past the beautiful student council president Izumi Touko, who also happens to be the only daughter of the head of the biggest karate organization in the world, Koudan-kai (which is totally not Kyokushin). What plot will Touko hatch, and what price is she going to exact from them? As Takeru and Meo embark on their official karate journey which will lead them to confront their pasts, almost the entire cast of Karate Shoukoushi Kohinata Minoru makes an appearance, guiding them, and teaching them the true meaning of what it is to be a karate-ka."},
{"id": "unordinary", "title": "unOrdinary", "image": "https://avt.mkklcdnv3.com/avatar_225/16820-unordinary.jpg", "story_alternative": [], "author": ["Urusai-baka"], "status": "Ongoing", "last_updated": "Feb-21-2019 15:02:18 PM", "view": "5,034,649", "genres": ["Fantasy", "Webtoons"], "score": "4.74", "votes": "340", "summary": "The world is not perfect. Learning to deal with its flaws is just a normal part of life. But there comes a point where these imperfections spawn a crushing realization... that something needs to change..."},
{"id": "cd918233", "title": "Kengan Omeg", "image": "https://avt.mkklcdnv3.com/avatar_225/21874-cd918233.jpg", "story_alternative": ["Alternative : ケンガンオメガ, Kengan Asura 2, Kengan Ashura 2"], "author": ["Daromeon", " Yabako Sandrovich"], "status": "Ongoing", "last_updated": "Feb-21-2019 22:19:29 PM", "view": "214,173", "genres": ["Action", "Drama", "Martial arts"], "score": "4.99", "votes": "70", "summary": "Sequel to Kengan Asura. Takes place 2 years after the tournament."},
{"id": "ut918329", "title": "Ase to Sekken", "image": "https://avt.mkklcdnv3.com/avatar_225/21970-ut918329.jpg", "story_alternative": ["Alternative : Sweat and Soap; あせとせっけん"], "author": ["Yamada Kintetsu"], "status": "Ongoing", "last_updated": "Feb-21-2019 21:52:28 PM", "view": "287,694", "genres": ["Comedy", "Romance", "Seinen"], "score": "4.84", "votes": "112", "summary": "Yaeshima Maasako is an office lady who has a complex about her excessive sweating and works at Lilia Drop, a company that manufactures makeup and bath products that are tremendously popular with women. While sparing no expenses with deodorant in her daily routine, one day Natori Koutarou of the commodity development department tells her, \"Your body odor is wonderful! To develop new soap, I'll be coming to smell you everyday from now on!\" Even so, she was not so opposed to the idea of being smelled..."},
{"id": "under_prin", "title": "Under Prin", "image": "https://avt.mkklcdnv3.com/avatar_225/286-under_prin.jpg", "story_alternative": ["Alternative : アンダープリン (Japanese); 언더프린 (Korean); UnderPrin (English)"], "author": ["Smbryms"], "status": "Ongoing", "last_updated": "Feb-21-2019 17:25:45 PM", "view": "1,638,155", "genres": ["Action", "Comedy", "Drama", "Fantasy", "Josei", "Manhwa", "Mystery", "Supernatural", "Webtoons"], "score": "4.19", "votes": "67", "summary": "From Easy Going Scans: Lord Perdien is a 1st class demon who has been living in the human world with his son. He has no intentions for his son, Miryu, to follow the path of the demons and while their lives were peaceful up until now, a succubus arrival and a sudden illness of his son are more than enough to disturb their peaceful way of living. He has to make an important choice: Either to let his son die or listen to whatever the succubus offers him for a cure."},
{"id": "kv918500", "title": "Kanojo ni Naritai Kimi to Boku", "image": "https://avt.mkklcdnv3.com/avatar_225/22143-kv918500.jpg", "story_alternative": ["Alternative : カノジョになりたい君と僕"], "author": ["Umi Takase"], "status": "Ongoing", "last_updated": "Feb-21-2019 19:54:58 PM", "view": "26,620", "genres": ["Drama", "Romance", "School life", "Shoujo", "Slice of life"], "score": "3.78", "votes": "9", "summary": "Hime Sakuragaike has secretly been in love with her childhood friend Akira Yonezawa since they were kids, but Hime only recently found out that Akira identifies as female. Although surprised, Hime offers her full support, and this is initially kept secret between them for a few years, but Akira decides to start living as a girl full-time upon starting high school with Hime. However, since Akira garners a certain amount of attention, Hime takes it upon herself to aggressively stick up for Akira whenever necessary. Not wanting Akira to be singled out as an object of ridicule, Hime decides that her only option is to put herself in Akira's shoes."},
{"id": "mahou_tsukai_no_yome", "title": "Mahou Tsukai no Yome", "image": "https://avt.mkklcdnv3.com/avatar_225/1140-mahou_tsukai_no_yome.jpg", "story_alternative": ["Alternative : 魔法使いの嫁; 魔法使之嫁; Die Braut des Magiers (German); Mahō Tsukai no Yome; Mahoutsukai no Yome; Oblubienica czarnoksiężnika (Polish); The Ancient Magus' Bride; The Magician's Bride; عروس الساحر العَهِيد (Arabic)"], "author": ["Yamazaki Kore"], "status": "Ongoing", "last_updated": "Feb-21-2019 14:21:15 PM", "view": "2,292,919", "genres": ["Drama", "Fantasy", "Romance", "Shounen", "Slice of life", "Supernatural"], "score": "4.81", "votes": "376", "summary": "With her mother dead and father long gone, Chise Hatori has spent her childhood being passed unwanted from relative to relative, until she finally makes her unfortunate way to a strange and improbable auction block. Offered as a “sleigh beggy” to the highest bidder, Chise is purchased by the (literally) boneheaded Elias Ainsworth, who promises to take her on as his apprentice. Elias is a mage, and his world is one of dragons and faeries - but before Chise can begin to get accustomed to all that nonsense, Elias drops another bombshell. Apparently Chise isn't just intended to be his apprentice - she will also be his bride.."},
{"id": "my918238", "title": "Shigahime", "image": "https://avt.mkklcdnv3.com/avatar_225/21879-my918238.jpg", "story_alternative": ["Alternative : Corpse Fang Princess; Shiga Hime; Shigahime; 屍牙姫"], "author": [" Sato Hirohisa "], "status": "Ongoing", "last_updated": "Feb-22-2019 00:10:25 AM", "view": "196,252", "genres": ["Ecchi", "Horror", "Psychological", "Seinen", "Supernatural"], "score": "4.32", "votes": "25", "summary": "From the author of Suzuki-san wa Tada Shizuka ni Kurashitai comes a story about a boy named Osamu Hirota who unwillingly loses his ability to live a normal life thanks to an immortal vampire woman and her former lackey Souichi. Cursed with the form of a monster and the need to hunt for blood to sustain a human form, how will Osamu cope with his new life?"},
{"id": "shiotasensei_to_amaichan", "title": "Shiota-sensei to Amai-chan", "image": "https://avt.mkklcdnv3.com/avatar_225/16373-shiotasensei_to_amaichan.jpg", "story_alternative": ["Alternative : å¡©ç”°å…ˆç”Ÿã\u0081¨é›¨äº•ã\u0081¡ã‚ƒã‚“ ; Shiota Sensei to Amai Chan"], "author": ["Nakatoka Kumiko"], "status": "Ongoing", "last_updated": "Feb-21-2019 17:40:58 PM", "view": "532,680", "genres": ["Josei", "Romance", "School life"], "score": "4.59", "votes": "66", "summary": "Shiota-sensei to Amai-chan summary is updating. Come visit Mangakakalot.com sometime to read the latest chapter of Shiota-sensei to Amai-chan. If you have any question about this manga, Please don't hesitate to contact us or translate team. Hope you enjoy it."},
{"id": "mahouka_koukou_no_rettousei_natsuyasumi_hen", "title": "Mahouka Koukou no Rettousei - Natsuyasumi Hen", "image": "https://avt.mkklcdnv3.com/avatar_225/18067-mahouka_koukou_no_rettousei_natsuyasumi_hen.jpg", "story_alternative": ["Alternative : 魔法科高校の劣等生 夏休み編 (Japanese)"], "author": ["Satou Tsutomu", " Yuzuki N'"], "status": "Ongoing", "last_updated": "Feb-21-2019 17:25:51 PM", "view": "181,498", "genres": ["Comedy", "Ecchi", "Romance", "Shounen"], "score": "4.74", "votes": "23", "summary": "Natsuyasumi-hen follows a variety of characters over their summer break between the Nine School Competition Arc and the Yokohama Disturbance Arc. (Adaption of Light Novel v05)"},
{"id": "tenseishichatta_yo_iya_gomen", "title": "Tenseishichatta yo (Iya, Gomen)", "image": "https://avt.mkklcdnv3.com/avatar_225/17858-tenseishichatta_yo_iya_gomen.jpg", "story_alternative": ["Alternative : 一不小心转生了 ; Tensei shi chatta yo (Iya, Gomen) ; Tensei Shichattayo (Iya, Gomen) ; Tenseishichattayo (Iya, Gomen)"], "author": ["Headphones Samurai", " Yatoyaniwa"], "status": "Ongoing", "last_updated": "Feb-21-2019 17:25:57 PM", "view": "4,302,858", "genres": ["Action", "Adventure", "Comedy", "Fantasy", "Shounen", "Supernatural"], "score": "4.77", "votes": "612", "summary": "From MangaHelpers: After a god screws up and accidentally takes high schooler Shou's life, he offers him reincarnation with a gift to make up for it. Shou asks to retain all his old memories for the new life. Shou is reborn as Will, a noble's son in a world where magic use is common and involves knowledge of kanji characters. With all his memories, he's a brilliant toddler, and when he experiments with magic, he finds that he has an amazing talent for it! What's more, though he was smart but unloved in his old life, in his new life he has a mother and a father who both love him deeply. His future as Will is looking very bright!"},
{"id": "ro918147", "title": "Raid", "image": "https://avt.mkklcdnv3.com/avatar_225/21785-ro918147.jpg", "story_alternative": ["Alternative : 레이드"], "author": ["Choi Jong Hyuk "], "status": "Ongoing", "last_updated": "Feb-21-2019 14:57:49 PM", "view": "1,382,837", "genres": ["Action", "Adventure", "Fantasy", "Shounen", "Supernatural"], "score": "4.4", "votes": "216", "summary": "Around 50 years ago, after the Korean War, Demon World Gates appeared abruptly all over the world."},
{"id": "hn918480", "title": "Release That Witch", "image": "https://avt.mkklcdnv3.com/avatar_225/22124-hn918480.jpg", "story_alternative": ["Alternative : 放开那个女巫"], "author": ["Er Mu", " Dr Woodman"], "status": "Ongoing", "last_updated": "Feb-21-2019 14:59:35 PM", "view": "283,333", "genres": ["Action", "Adventure", "Drama", "Fantasy", "Harem", "Historical", "Seinen", "Supernatural", "Webtoons"], "score": "4.79", "votes": "95", "summary": "A male engineer transmigrated into another world, and became a prince. This place strikingly resembles the Middle Ages of Europe, but at the same time, it seems kind of different? Witches truly exists, and they even possess magic powers! Magic powers are productive forces! Save the witches, liberate the productive forces! Open map, fight demons, break conspiracies, climb up the science and technology tree, and open the path of hardcore ‘farming’!"},
{"id": "high_school_inari_tamamochan", "title": "High School Inari Tamamo-chan!", "image": "https://avt.mkklcdnv3.com/avatar_225/20254-high_school_inari_tamamochan.jpg", "story_alternative": ["Alternative : お稲荷JKたまもちゃん！ ; O-Inari JK Tamamo Chan"], "author": ["Yuuki Ray"], "status": "Ongoing", "last_updated": "Feb-21-2019 14:55:10 PM", "view": "471,275", "genres": ["Comedy", "School life", "Slice of life"], "score": "4.71", "votes": "55", "summary": "Tamamo says she’s a transfer student from Kyoto, but her true identity is an Inari from the Fushimi Inari Shrine! Most adults see her as a beautiful young girl, but her classmates see her for what she really is, which they keep underwraps as they interact with her in this heartfelt comedy manga!"},
{"id": "pn918005", "title": "Solo Leveling", "image": "https://avt.mkklcdnv3.com/avatar_225/21619-pn918005.jpg", "story_alternative": ["Alternative : 나 혼자만 레벨업"], "author": ["Sung-Lak Jang"], "status": "Ongoing", "last_updated": "Feb-21-2019 14:50:39 PM", "view": "19,459,674", "genres": ["Action", "Adventure", "Fantasy", "Shounen", "Webtoons"], "score": "4.82", "votes": "4387", "summary": "10 years ago, after “the Gate” that connected the real world with the monster world opened, some of the ordinary, everyday people received the power to hunt monsters within the Gate. They are known as \"Hunters\". However, not all Hunters are powerful. My name is Sung Jin-Woo, an E-rank Hunter. I'm someone who has to risk his life in the lowliest of dungeons, the \"World's Weakest\". Having no skills whatsoever to display, I barely earned the required money by fighting in low-leveled dungeons… at least until I found a hidden dungeon with the hardest difficulty within the D-rank dungeons! In the end, as I was accepting death, I suddenly received a strange power, a quest log that only I could see, a secret to leveling up that only I know about! If I trained in accordance with my quests and hunted monsters, my level would rise. Changing from the weakest Hunter to the strongest S-rank Hunter!"},
{"id": "wish_fulfillment_2", "title": "Wish Fulfillment", "image": "https://avt.mkklcdnv3.com/avatar_225/16133-wish_fulfillment_2.jpg", "story_alternative": [], "author": [], "status": "Ongoing", "last_updated": "Feb-21-2019 15:38:35 PM", "view": "31,865", "genres": ["Action", "Adult", "Adventure", "Comedy", "Cooking", "Doujinshi", "Drama", "Ecchi", "Fantasy", "Gender bender", "Harem", "Historical", "Horror", "Josei", "Manhua", "Manhwa", "Martial arts", "Mature", "Mecha", "Medical", "Mystery", "One shot", "Psychological", "Romance", "School life", "Sci fi", "Seinen", "Shoujo", "Shoujo ai", "Shounen", "Shounen ai", "Slice of life", "Smut", "Sports", "Supernatural", "Tragedy", "Webtoons", "Yaoi", "Yuri"], "score": "5", "votes": "5", "summary": "Wish Fulfillment summary is updating. Come visit Mangakakalot.com sometime to read the latest chapter of Wish Fulfillment. If you have any question about this manga, Please don't hesitate to contact us or translate team. Hope you enjoy it."},
{"id": "evergreen_tea_shop", "title": "Evergreen Tea Shop", "image": "https://avt.mkklcdnv3.com/avatar_225/3118-evergreen_tea_shop.jpg", "story_alternative": ["Alternative : 늘 푸른 찻집 (Korean); Evergreen Tea House (English)"], "author": ["Go Byeong Joon", " Jae Nyu"], "status": "Ongoing", "last_updated": "Feb-21-2019 14:50:23 PM", "view": "660,627", "genres": ["Comedy", "Drama", "Manhwa", "Romance", "School life", "Shoujo", "Slice of life", "Webtoons"], "score": "4.91", "votes": "66", "summary": "A bittersweet growth story about headstrong children."},
{"id": "yd918058", "title": "Tada's Do-It-All House", "image": "https://avt.mkklcdnv3.com/avatar_225/21673-yd918058.jpg", "story_alternative": ["Alternative : Mahoro Ekimae Tada Benriken, Тада – мастер на все руки из Махоро, まほろ駅前多田便利軒"], "author": ["Yugi Yamada", " Miura Shion"], "status": "Ongoing", "last_updated": "Feb-21-2019 14:20:41 PM", "view": "51,691", "genres": ["Comedy", "Drama", "Josei", "Romance", "Slice of life"], "score": "3", "votes": "10", "summary": "In the fictional Tokyo suburb of Mahoro, Keisuke Tada (Eita) works as a \"benriya\" - a general problem solver for hire."},
{"id": "gotoubun_no_hanayome", "title": "Go-Toubun no Hanayome", "image": "https://avt.mkklcdnv3.com/avatar_225/18258-gotoubun_no_hanayome.jpg", "story_alternative": ["Alternative : 五等分の花嫁 ; The Five Wedded Brides"], "author": ["Haruba Negi"], "status": "Completed", "last_updated": "Feb-21-2019 14:20:21 PM", "view": "7,698,556", "genres": ["Comedy", "Ecchi", "Harem", "One shot", "Romance", "School life", "Shounen", "Slice of life"], "score": "4.84", "votes": "801", "summary": "Go-Toubun no Hanayome summary is updating. Come visit Mangakakalot.com sometime to read the latest chapter of Go-Toubun no Hanayome. If you have any question about this manga, Please don't hesitate to contact us or translate team. Hope you enjoy it."}
]